---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionLAngle
source: html/5aea81c1-8dcf-d9d4-9dca-380afc2f7da3.htm
---
# StructuralSectionLAngle Members

Creates a new instance of Structural Section L Angle shape with the associated set of parameters,
 used to attach to structural element.